---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetPropertyTime
source: html/c9445ffa-1b84-89cd-0634-ff991f8443f8.htm
---
# AssetPropertyTime Methods

Adds a new connected asset attached to this asset property, if it allows it.